package com.javarush.test.level00.lesson03.task02;

/* На дворе 31 век
Написать программу, выводящую на экран нынешний год. На дворе 31 век, если что.

Подсказка:
Возьмите текущий год и измените век на 31.
Вывести нужно число, состоящее из четырех цифр.
*/
public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        int a = 10;
        int b = 2016;
        System.out.println(b+(a*100));
    }
}
